zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/KW43B43ZC7_COMMON.h
#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  1         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            1         /**< Defines if an SAU is present or not */

#include "core_cm33.h"                 /* Core Peripheral Access Layer */
#include "system_KW43B43ZC7.h"         /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef KW43B43ZC7_SERIES
#define KW43B43ZC7_SERIES
#endif
/* CPU specific feature definitions */
#include "KW43B43ZC7_features.h"

/* ADC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSADC_0 base address */
  #define HSADC_0_BASE                             (0x5002F000u)
  /** Peripheral HSADC_0 base address */
  #define HSADC_0_BASE_NS                          (0x4002F000u)
  /** Peripheral HSADC_0 base pointer */
  #define HSADC_0                                  ((ADC_Type *)HSADC_0_BASE)
  /** Peripheral HSADC_0 base pointer */
  #define HSADC_0_NS                               ((ADC_Type *)HSADC_0_BASE_NS)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { HSADC_0_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { HSADC_0 }
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS_NS                        { HSADC_0_BASE_NS }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS_NS                         { HSADC_0_NS }
#else
  /** Peripheral HSADC_0 base address */
  #define HSADC_0_BASE                             (0x4002F000u)
  /** Peripheral HSADC_0 base pointer */
  #define HSADC_0                                  ((ADC_Type *)HSADC_0_BASE)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { HSADC_0_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { HSADC_0 }
#endif
/** Interrupt vectors for the ADC peripheral type */
#define ADC_IRQS                                 { ADC0_IRQn }

/* AOI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AOI_0 base address */
  #define AOI_0_BASE                               (0x50036000u)
  /** Peripheral AOI_0 base address */
  #define AOI_0_BASE_NS                            (0x40036000u)
  /** Peripheral AOI_0 base pointer */
  #define AOI_0                                    ((AOI_Type *)AOI_0_BASE)
  /** Peripheral AOI_0 base pointer */
  #define AOI_0_NS                                 ((AOI_Type *)AOI_0_BASE_NS)
  /** Array initializer of AOI peripheral base addresses */
  #define AOI_BASE_ADDRS                           { AOI_0_BASE }
  /** Array initializer of AOI peripheral base pointers */
  #define AOI_BASE_PTRS                            { AOI_0 }
  /** Array initializer of AOI peripheral base addresses */
  #define AOI_BASE_ADDRS_NS                        { AOI_0_BASE_NS }
  /** Array initializer of AOI peripheral base pointers */
  #define AOI_BASE_PTRS_NS                         { AOI_0_NS }
#else
  /** Peripheral AOI_0 base address */
  #define AOI_0_BASE                               (0x40036000u)
  /** Peripheral AOI_0 base pointer */
  #define AOI_0                                    ((AOI_Type *)AOI_0_BASE)
  /** Array initializer of AOI peripheral base addresses */
  #define AOI_BASE_ADDRS                           { AOI_0_BASE }
  /** Array initializer of AOI peripheral base pointers */
  #define AOI_BASE_PTRS                            { AOI_0 }
#endif

/* ATX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ATX_0 base address */
  #define ATX_0_BASE                               (0x50031000u)
  /** Peripheral ATX_0 base address */
  #define ATX_0_BASE_NS                            (0x40031000u)
  /** Peripheral ATX_0 base pointer */
  #define ATX_0                                    ((ATX_Type *)ATX_0_BASE)
  /** Peripheral ATX_0 base pointer */
  #define ATX_0_NS                                 ((ATX_Type *)ATX_0_BASE_NS)
  /** Array initializer of ATX peripheral base addresses */
  #define ATX_BASE_ADDRS                           { ATX_0_BASE }
  /** Array initializer of ATX peripheral base pointers */
  #define ATX_BASE_PTRS                            { ATX_0 }
  /** Array initializer of ATX peripheral base addresses */
  #define ATX_BASE_ADDRS_NS                        { ATX_0_BASE_NS }
  /** Array initializer of ATX peripheral base pointers */
  #define ATX_BASE_PTRS_NS                         { ATX_0_NS }
#else
  /** Peripheral ATX_0 base address */
  #define ATX_0_BASE                               (0x40031000u)
  /** Peripheral ATX_0 base pointer */
  #define ATX_0                                    ((ATX_Type *)ATX_0_BASE)
  /** Array initializer of ATX peripheral base addresses */
  #define ATX_BASE_ADDRS                           { ATX_0_BASE }
  /** Array initializer of ATX peripheral base pointers */
  #define ATX_BASE_PTRS                            { ATX_0 }
#endif

/* AXBS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AXBS_0 base address */
  #define AXBS_0_BASE                              (0x50000000u)
  /** Peripheral AXBS_0 base address */
  #define AXBS_0_BASE_NS                           (0x40000000u)
  /** Peripheral AXBS_0 base pointer */
  #define AXBS_0                                   ((AXBS_Type *)AXBS_0_BASE)
  /** Peripheral AXBS_0 base pointer */
  #define AXBS_0_NS                                ((AXBS_Type *)AXBS_0_BASE_NS)
  /** Peripheral AXBS_MAIN_0 base address */
  #define AXBS_MAIN_0_BASE                         (0x5003D000u)
  /** Peripheral AXBS_MAIN_0 base address */
  #define AXBS_MAIN_0_BASE_NS                      (0x4003D000u)
  /** Peripheral AXBS_MAIN_0 base pointer */
  #define AXBS_MAIN_0                              ((AXBS_Type *)AXBS_MAIN_0_BASE)
  /** Peripheral AXBS_MAIN_0 base pointer */
  #define AXBS_MAIN_0_NS                           ((AXBS_Type *)AXBS_MAIN_0_BASE_NS)
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS                          { AXBS_0_BASE, AXBS_MAIN_0_BASE }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS                           { AXBS_0, AXBS_MAIN_0 }
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS_NS                       { AXBS_0_BASE_NS, AXBS_MAIN_0_BASE_NS }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS_NS                        { AXBS_0_NS, AXBS_MAIN_0_NS }
#else
  /** Peripheral AXBS_0 base address */
  #define AXBS_0_BASE                              (0x40000000u)
  /** Peripheral AXBS_0 base pointer */
  #define AXBS_0                                   ((AXBS_Type *)AXBS_0_BASE)
  /** Peripheral AXBS_MAIN_0 base address */
  #define AXBS_MAIN_0_BASE                         (0x4003D000u)
  /** Peripheral AXBS_MAIN_0 base pointer */
  #define AXBS_MAIN_0                              ((AXBS_Type *)AXBS_MAIN_0_BASE)
  /** Array initializer of AXBS peripheral base addresses */
  #define AXBS_BASE_ADDRS                          { AXBS_0_BASE, AXBS_MAIN_0_BASE }
  /** Array initializer of AXBS peripheral base pointers */
  #define AXBS_BASE_PTRS                           { AXBS_0, AXBS_MAIN_0 }
#endif

/* BLE2_REG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral BLE2_REG base address */
  #define BLE2_REG_BASE                            (0x50110000u)
  /** Peripheral BLE2_REG base address */
  #define BLE2_REG_BASE_NS                         (0x40110000u)
  /** Peripheral BLE2_REG base pointer */
  #define BLE2_REG                                 ((BLE2_REG_Type *)BLE2_REG_BASE)
  /** Peripheral BLE2_REG base pointer */
  #define BLE2_REG_NS                              ((BLE2_REG_Type *)BLE2_REG_BASE_NS)
  /** Array initializer of BLE2_REG peripheral base addresses */
  #define BLE2_REG_BASE_ADDRS                      { BLE2_REG_BASE }
  /** Array initializer of BLE2_REG peripheral base pointers */
  #define BLE2_REG_BASE_PTRS                       { BLE2_REG }
  /** Array initializer of BLE2_REG peripheral base addresses */
  #define BLE2_REG_BASE_ADDRS_NS                   { BLE2_REG_BASE_NS }
  /** Array initializer of BLE2_REG peripheral base pointers */
  #define BLE2_REG_BASE_PTRS_NS                    { BLE2_REG_NS }
#else
  /** Peripheral BLE2_REG base address */
  #define BLE2_REG_BASE                            (0x40110000u)
  /** Peripheral BLE2_REG base pointer */
  #define BLE2_REG                                 ((BLE2_REG_Type *)BLE2_REG_BASE)
  /** Array initializer of BLE2_REG peripheral base addresses */
  #define BLE2_REG_BASE_ADDRS                      { BLE2_REG_BASE }
  /** Array initializer of BLE2_REG peripheral base pointers */
  #define BLE2_REG_BASE_PTRS                       { BLE2_REG }
#endif

/* BRIC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral BRIC base address */
  #define BRIC_BASE                                (0x50106700u)
  /** Peripheral BRIC base address */
  #define BRIC_BASE_NS                             (0x40106700u)
  /** Peripheral BRIC base pointer */
  #define BRIC                                     ((BRIC_Type *)BRIC_BASE)
  /** Peripheral BRIC base pointer */
  #define BRIC_NS                                  ((BRIC_Type *)BRIC_BASE_NS)
  /** Array initializer of BRIC peripheral base addresses */
  #define BRIC_BASE_ADDRS                          { BRIC_BASE }
  /** Array initializer of BRIC peripheral base pointers */
  #define BRIC_BASE_PTRS                           { BRIC }
  /** Array initializer of BRIC peripheral base addresses */
  #define BRIC_BASE_ADDRS_NS                       { BRIC_BASE_NS }
  /** Array initializer of BRIC peripheral base pointers */
  #define BRIC_BASE_PTRS_NS                        { BRIC_NS }
#else
  /** Peripheral BRIC base address */
  #define BRIC_BASE                                (0x40106700u)
  /** Peripheral BRIC base pointer */
  #define BRIC                                     ((BRIC_Type *)BRIC_BASE)
  /** Array initializer of BRIC peripheral base addresses */
  #define BRIC_BASE_ADDRS                          { BRIC_BASE }
  /** Array initializer of BRIC peripheral base pointers */
  #define BRIC_BASE_PTRS                           { BRIC }
#endif

